using namespace std; 
#include <iostream>

int main()
{
    setlocale(0, "");
    int a;
    cout << "Введите номер для недели: ";
    cin >> a;
    if (a == 1)
    {
        cout << "классный час" << '\n';
        cout << "математика" << '\n';
        cout << "физика" << '\n';
        cout << "информатика" << '\n';
    }
    else if (a == 2)
    {
        cout << "физра" << '\n';
        cout << "системное програмирование" << '\n';
        cout << "построенние базз данных" << '\n';
    }
    else if (a == 3)
    {
        cout << "высшая математика" << '\n';
        cout << "теория вероятности" << '\n';
        cout << "тригонометрия" << '\n';
        cout << "физра" << '\n';
    }
    else if (a == 4)
    {
        cout << "пара" << '\n';
        cout << "пара" << '\n';
        cout << "пара" << '\n';
        cout << "пара" << '\n';
    }
    else if (a == 5)
    {
        cout << "пара" << '\n';
        cout << "пара" << '\n';
        cout << "пара" << '\n';
        cout << "пара" << '\n';
    }
    else if (a == 6)
    {
        cout << "выходной либо листанат" << '\n';
    }
    else if (a == 5)
    {
        cout << "выходной" << '\n';
    }
}
